Planning/201612_CDIO_Reflections.org
#+Title: Reflektionsrapport PA1435
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2016-12-19
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:2 toc:nil
# #+STARTUP: showall
#+STARTUP: beamer

# #+LATEX_HEADER: \usepackage[a4paper]{geometry}
#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+LATEX_HEADER: \usepackage[margin=3.5cm]{geometry}
# #+LATEX_CLASS: beamer
#+BEAMER_THEME: BTH_msv


* Introduktion
  Kursen /PA1435, Objektorienterad Design/ omfattar 6hp och är en av i nuläget fyra kurser som på olika vis berör samma ämnesområde. De olika kurserna är listade i Tabell [[tab:Kurser]]. Totalt sett rör det sig om mellan 180 till 200 studenter som går de olika kurserna.

#+NAME: tab:Kurser
#+CAPTION: Relaterade Kurser
#+ATTR_LATEX: :align lp{4cm}rp{4cm} :placement [!b]
| Kurskod | Namn                                               | Omfattning | Program                                                    |
|---------+----------------------------------------------------+------------+------------------------------------------------------------|
| PA1415  | Programvarudesign                                  |        7.5 | BSc i Spelprogrammering, BSc i IT-Säkerhet                 |
| PA1434  | Grunder i Objektorienterad Design                  |          4 | CI i IndEk                                                 |
| PA1435  | Objektorienterad Design                            |          6 | CI i Spel- och Programvaruteknik, CI i Industriell Ekonomi |
| PA1443  | Introduktion till Programvarudesign och Arkitektur |          5 | BSc i Programvaruteknik                                    |
|---------+----------------------------------------------------+------------+------------------------------------------------------------|

Kursmålen (Se Tabell [[tab:CourseGoals]] beskriver en viss evolution, där PA1415 har de äldsta målen (senast reviderade 2014, ej i det "nya" formatet) och PA1443 har de nyaste. Det är heller inte ett fullständigt överlapp mellan de ämnen som skall tas upp i varje kurs. För att förstå överlappet behövs en kortfattad genomgång av ämnet.

#+NAME: tab:CourseGoals
#+CAPTION: Kursmålen för de nuvarande kurserna
#+ATTR_LATEX: :align p{3cm}p{12cm} :placement [!t]
  | Kurskod                       | Kursmål                                                                                                                            |
  |-------------------------------+------------------------------------------------------------------------------------------------------------------------------------|
  | PA1415                        | - på en grundläggande nivå i grupp kunna ta fram krav på en programvara och uttrycka dem i en kravspecifikation                    |
  | PA1415                        | - i grupp producera en översiktlig utvecklingsprojektplan baserat på en kravspecifikation                                          |
  | PA1415 (PA1435/PA1434)        | - i grupp kunna skapa en detaljerad objektorienterad design för ett mjukvaruprogram                                                |
  | PA1415                        | - i grupp kunna implementera ett mjukvaruprogram inom rimlig tid, baserat på en kravspecifikation och en objektorienterad design   |
  | PA1415 (PA1443)               | - på en grundläggande nivå i grupp kunna planera och genomföra testning av producerad programvara, baserat på en kravspecifikation |
  | PA1415 (PA1435/PA1434)        | - skapa och analysera objektorienterade artefakter uttryckta i UML                                                                 |
  | PA1415 (PA1435/PA1434/ PA1443)    | - kunna motivera och använda designmönster i utvecklingen av mjukvarusystem                                                        |
  |                               |                                                                                                                                    |
  |                               | *Kunskap och förståelse*                                                                                                           |
  | PA1435/PA1434/ PA1443         | - kunna visa förståelse för grundläggande principer i objektorienterad programvaruutveckling.                                      |
  | PA1435/PA1434                 | - kunna visa förståelse för UML som modelleringsspråk.                                                                             |
  | PA1435/PA1434/ PA1443         | - kunna visa kunskap om grundläggande designprinciper.                                                                             |
  | PA1435/PA1434/ PA1443         | - kunna visa kunskap om grundläggande designmönster.                                                                               |
  | PA1443                        | - kunna visa kunskap om grundläggande mjukvaruarkitekturstilar                                                                     |
  |                               |                                                                                                                                    |
  |                               | *Färdigheter och förmåga*                                                                                                          |
  | PA1435/PA1434/ PA1443         | - kunna uttrycka strukturen och beteendet hos ett system i termer av objektorienterade koncept.                                    |
  | PA1435/PA1434                 | - kunna korrekt använda UML för att uttrycka struktur och beteende hos ett system.                                                 |
  | PA1435/PA1434                 | - kunna korrekt transformera en objektorienterad design till källkod.                                                              |
  | PA1435/PA1434                 | - kunna tillämpa designprinciper och designmönster i allmänhet och inom en särskild domän.                                         |
  | PA1443                        | - kunna tillämpa grundläggande designmönster i en objektorienterad design.                                                         |
  | PA1443                        | - kunna skapa en objektorienterad design för ett system enligt goda objektorienterade designprinciper                              |
  | PA1443                        | - kunna tillämpa grundläggande arkitekturstilar för ett mjukvarusystem                                                             |
  | PA1443                        | - kunna resonera om de kvalitetsegenskaper ett system med en viss arkitekturstil har eller bör ha                                  |
  | PA1443                        | - kunna resonera om och skapa en grundläggande testplan för ett objektorienterat system                                            |
  |                               |                                                                                                                                    |
  |                               | *Värderingsförmåga och förhållningssätt*                                                                                           |
  | PA1435/ PA1434                | - kunna analysera källkod för eventuella förbättringar.                                                                            |
  | PA1435/PA1434/ PA1443         | - kunna analysera och kritiskt diskutera en design för eventuella förbättringar.                                                   |
  |-------------------------------+------------------------------------------------------------------------------------------------------------------------------------|

