Planning/201612_CDIO_Reflections.org
** En Kortfattad Genomgång av Ämnet
   Kärnan i kursen är ett arbetssätt med notationsstöd för att skapa mjukvarudesigner. Detta arbetssätt är i princip en miniatyr-version av Conceive-Design-Implement -tankarna. Detta designarbetssätt passas in i ett utvecklingsprojekt, där man lägger ytterligare tonvikt på kravinsamling, projektplanering, och -- såklart -- implementation och testning. När systemen blir större behöver man strukturera det på olika nivåer, både den mikronivå som är kärnan i kursen, men också på en "makronivå", eller en arkitekturnivå. Genomgående för alla nivåer är att man det finns inte ett enda rätt eller fel, utan det finns ett antal goda egenskaper man förväntar sig av ett system (där kanske det främsta är att man enkelt skall kunna underhålla systemet), och ett antal principer för konstruktionen som leder till en design eller arkitektur med de förväntade egenskaperna. Att lära ut notationen och arbetssättet är relativt enkelt -- det är "bara" för studenterna att härma [fn:cargocult:Se /Cargo-Culting/, t.ex. https://en.wikipedia.org/wiki/Cargo_cult]. Att förstå konsekvenserna av att göra designen på ett visst sätt, eller varför ett visst analys-steg ens är nödvändigt, kräver en djupare förståelse för dessa grundläggande designprinciper.

   Detta skall då sys ihop i olika kurser, med något olika fokus. Grovt kan man indela ämnet i /Kravinsamling, Utvecklingsmetodiker, Projektplanering, Objektorienterad Analys, Objektorienterad Design, Överföring av Design till Implementation, Mjukvaruarkitekturer/, och /Testning/ -- där mycket av detta syftar till att också få ett underhållbart system. Tabell [[tab:Subjects]] sammanfattar hur jag valt att sprida dessa ämnen över de olika kurserna. Notera att samtliga delämnen (förutom kärnämnena i detta kurspaket, markerade med fetstil i tabellen) också har en eller flera egna kurser á minst 7.5hp -- många av dem på avancerad nivå.

#+NAME: tab:Subjects
#+CAPTION: Berörda delämnen per kurs
#+ATTR_LATEX: :align l*{4}{p{1.2cm}} :placement [bt]
   | Delämne                                    | PA1415 | *PA1434* | *PA1435* | PA1443 |
   |--------------------------------------------+--------+----------+----------+--------|
   | Projektplanering                           | Ja     |          |          |        |
   | Utvecklingsmetodiker                       | delvis | delvis   | delvis   |        |
   | Kravinsamling                              | Ja     | delvis   | delvis   |        |
   | *Objektorienterad Analys*                  | Ja     | Ja       | Ja       | delvis |
   | *Objektorienterad Design*                  | Ja     | Ja       | Ja       | Ja     |
   | *Överföring av Design till Implementation* | Ja     | delvis   | Ja       | delvis |
   | Mjukvaruarkitekturer                       | delvis |          |          | Ja     |
   | Testning                                   | Ja     | delvis   | delvis   | Ja     |
   |--------------------------------------------+--------+----------+----------+--------|

* Nuläge
  Nuläget är inte helt enkelt att beskriva eftersom jag nyligen tog över kursen av en pensionerad kollega. Jag var inblandad i föreläsningarna den senaste omgången, och håller nu på att arbeta om kurserna för att bättre ta hand om de olika perspektiven och nytillkommna kurser. Jag väljer därför att beskriva hur kurserna kommer se ut när de ges till våren, eftersom det är den mest relevanta bilden.

  "Drick din egen Champagne" är ett uttryck som jag försöker tillämpa i den här kursen. Jag har tagit intryck av moderna utvecklingsmetodiker inom Agile/Lean, och Scrum i synnerhet, och har delat in kursen i en mängd små block, så kallade /sprintar/, som fokuserar på ett mindre delämne (mindre ändå än de som är listade i Tabell [[tab:Subjects]]). Dessa sprintar har för avsikt att:

  - Ge en kortfattad textbaserad introduktion till delämnet.
  - Ge anvisningar om vad studenten förväntas läsa för att sätta sig in i delämnet. Detta innefattar kapitel i kursboken, andra relevanta böcker, onlinematerial, och ibland forskningsartiklar.
  - Erbjuda ett antal videoföreläsningar där de rent mekaniska greppen (t.ex. notationer) gås igenom.
  - Erbjuda ett antal övningar för självstudier
  - Erbjuda ett antal uppgifter på ett större exempel (för senare examination).

  Till varje sprint är även kopplat en eller fler föreläsningar, där fokus är på att -- tillsammans med studenterna -- diskutera hur man gör en /bra/ design, dvs. hur man tillämpar de genomgånga designprinciperna för att skapa en hållbar design/arkitektur med de egenskaper man önskar. Det är alltså en blandform mellan klassiska föreläsningar och seminarier.

  Ett större exempel löper genom hela kursen, med ett för studenterna relevant mjukvarupronblem. Studenterna förväntas med moderna verktyg genomföra alla moment som lärs ut. Med jämna mellanrum finns så kallade /release-sprintar/ där de får paketera ihop sina lösningar till en leverabel som sedan används för examination och betygssättning. Kopplat till detta större exempel finns övningstillfällen i mindre grupper, där studenterna får diskutera uppgifterna och sina lösningar.

  Jag har medvetet valt att låna begrepp från mjukvaruutvecklingsdomänen för att ytterligare hammra in modern utvecklingsmetodik. Varje sprint har alltså ett antal /user stories/ (Agil-världens motsvarighet till krav) som är skrivna ur perspektiv av de yrkesroller som är berörda av det som avhandlas i sprinten. Vidare finns det /acceptanskriterier/ för varje uppgift så att studenterna själva kan göra en bedömning av om de löst uppgiften eller inte. En /testplan/ utvecklas kontinuerligt av studenterna genom sprintarna där de för sin egen del beskriver hur de kan testa att de lärt sig det de förväntas i sprinten. Studenterna förväntas också underhålla en /kurs-backlog/ (en backlog är en lista med prioriterade user stories), där de kan lägga in frågor de behöver få besvarade, tankar som de vill följa upp, eller fudneringar på hur man kan använda det de lärt sig i ett vidare sammanhang. Idén är att när kursen är slut så innehåller backloggen ett antal pekare framåt för hur studenterna skall använda det de lärt sig i andra kurser och i sitt framtida yrkesliv. Slutligen har varje sprint ett /acceptanstest/ där studenterna enkelt kan checka av att de gjort allt de skall i sprinten.

  Kursen i dess tidigare utformning var väldigt akademisk, och som motvikt så har jag omformat den baserat på ett stort antal diskussioner med yrkesverksamma från hela världen. Vi har inte diskuterat just denna kursen, utan mer hållt allmänna diskussioner om modern programvaruutveckling, och vilka kunskaper och värderingar som de önskar se i bra programvaruutvecklare. Denna rörelse är också i enighet med vad jag hört att studenterna efterfrågar, så jag skulle vilja påstå att kursen är baserad på (om än inte granskad eller validerad av) kunskaper och önskemål från såväl lärare, studenter, och näringslivsrepresentanter. Jag tror det är svårt att få en kurs där både lärare och näringslivsrepresentanter är nöjda, då forskningsområdet drar starkt åt ett håll (mer formalism), och näringslivet drar lika starkt åt det andra hållet (mer pragmatism). Tyvärr är denna skism ganska djup och oöverstigbar. Min lösning är att ge studenterna ett pragmatiskt verktyg men med översiktlig kunskap om den av akademin så omhuldade formalismen.
