Planning/201612_CDIO_Reflections.org
* Svagheter, Utvecklingspotential
  Svagheter som jag kan se i nuläget är att många av de inblandade utbildningsprogrammen har en förväntan att alla kurser skall handla om deras särintresse. Jag kommer inte hinna möta denna förväntan under VT2017, utan jag kommer ge en generisk bild där jag kryddar friskt med exempel, problemställningar, och anekdoter från de olika särintressena. Över tid planerar jag att göra en eller flera sprintar om varje särintresse som kan bidra med "rätt" perspektiv till den generiska bild som erbjuds i kärn-sprintarna.

  En annan utmaning är det stora gapet mellan forskningsfronten och nuvarande industripraxis. Industripraxis är dessutom synnerligen pragmatiskt och rudimentärt när det gäller programvarudesign. Här har jag valt sida och hävdar att det är viktigare att först förstå hur man kan använda teorierna i praktiken och vilka begränsningar man kommer stöta på, snarare än den abstrakta teoribildningen. Mitt bidrag är måhända att jag samtidigt erbjuder en verktygslåda som är mer mångsidig än den som i nuläget används av industrin, med ledtrådar till när respektive verktyg är lämpligt att använda eller (inte minst viktigt) inte användas. Samtidigt erbjuder jag en viss översikt över forskningsfronten också. Tyvärr är, som redan antytts, denna forskningsfront så långt ifrån någonting praktiskt användbart att studenterna sällan inser nyttan med den.
  
  Det är många utbildningsprogram inblandade i de olika kurserna, och det är därför en utmaning att synkronisera och integrera innehållet med övriga kurser på deras respektive program. Jag ser det här som ett ständigt pågående arbete att föra diskussioner med de olika programansvariga för att åstadkomma denna integration. I nuläget har dock fokus varit på att få en översikt över materialet och genomförandet, så jag har främst vilat på historiska lagrar.
#+LATEX: \newpage
* Utvecklinsgförslag och mål i förhållande till utbildningsplan och CDIO syllabus
  Jag har ett antal olika mål med hur jag genomför kurserna i programvarudesign:

  - Studenterna skall främst förstå vad som är en bra design, och vad man skall göra för att åstadkomma en bra design.
  - Studenterna skall möta en blandning av realistiska problem -- både stora och små -- där man tydligt kan resonera om styrkor och svagheter med olika lösningar.
  - Studenterna skall skaffa sig en bred och mångsidig verktygslåda för programvarudesign, med en ingående förståelse för syftet med varje verktyg.
  - Studenterna skall skaffa sig en översiktlig förståelse för forskningsfronten inom ämnet och av skilnaderna mellan forskning och produktion.
  - Studenterna skall använda modern teknologi och moderna arbetssätt när de arbetar i kursen.
  - Kursen skall använda sig av modern teknologi och moderna arbetssätt för att erbjuda kursinnehållet.
  - Studenterna skall -- i alla kurser -- utsättas för ett arbetssätt och en mentalitet som är baserad på modern industripraxis.      
* TODO maila ulrica.skagert@bth.se				   :noexport:
* TODO Reflektionsrapport 1-3 sidor				   :noexport:
* TODO EN CDIO-kurs						   :noexport:
  - hög grad erfarenheter för lärande enligt C-D-I-O
  - väl avvägda lärandemål omfattar kunskaper förmågor och förhållningssätt
    - granskade och validerade av centrala intressenter
      - lärare
      - studenter
      - alumni
      - näringslivsrepresentanter
  - lärandemål strukturerade enligt metoder för ett undersökande och aktivt lärande
  - studenterna inom kursen arbetar med implementering av teoretiska begrepp i praktik och reella problem
  - utvecklar på ett genomtänkt sätt studenternas ingenjörsmässiga personliga och professionella egenskaper
  - examineras mot lärandemål med moderna examinationsmetoder
  - integrerad i programmet
  - ger studenterrna insikt i sambandet mellan grundläggande forskning och teknikutveckling och samhällsutveckling i stort
  - har välfungerande processer för kursutvärdering och kursutveckling

