Planning/201612_CDIO_Reflections.tex
\section{Svagheter, Utvecklingspotential}
\label{sec:orgheadline4}
Svagheter som jag kan se i nuläget är att många av de inblandade utbildningsprogrammen har en förväntan att alla kurser skall handla om deras särintresse. Jag kommer inte hinna möta denna förväntan under VT2017, utan jag kommer ge en generisk bild där jag kryddar friskt med exempel, problemställningar, och anekdoter från de olika särintressena. Över tid planerar jag att göra en eller flera sprintar om varje särintresse som kan bidra med ``rätt'' perspektiv till den generiska bild som erbjuds i kärn-sprintarna.

En annan utmaning är det stora gapet mellan forskningsfronten och nuvarande industripraxis. Industripraxis är dessutom synnerligen pragmatiskt och rudimentärt när det gäller programvarudesign. Här har jag valt sida och hävdar att det är viktigare att först förstå hur man kan använda teorierna i praktiken och vilka begränsningar man kommer stöta på, snarare än den abstrakta teoribildningen. Mitt bidrag är måhända att jag samtidigt erbjuder en verktygslåda som är mer mångsidig än den som i nuläget används av industrin, med ledtrådar till när respektive verktyg är lämpligt att använda eller (inte minst viktigt) inte användas. Samtidigt erbjuder jag en viss översikt över forskningsfronten också. Tyvärr är, som redan antytts, denna forskningsfront så långt ifrån någonting praktiskt användbart att studenterna sällan inser nyttan med den.

Det är många utbildningsprogram inblandade i de olika kurserna, och det är därför en utmaning att synkronisera och integrera innehållet med övriga kurser på deras respektive program. Jag ser det här som ett ständigt pågående arbete att föra diskussioner med de olika programansvariga för att åstadkomma denna integration. I nuläget har dock fokus varit på att få en översikt över materialet och genomförandet, så jag har främst vilat på historiska lagrar.
\newpage
\section{Utvecklinsgförslag och mål i förhållande till utbildningsplan och CDIO syllabus}
\label{sec:orgheadline5}
Jag har ett antal olika mål med hur jag genomför kurserna i programvarudesign:

\begin{itemize}
\item Studenterna skall främst förstå vad som är en bra design, och vad man skall göra för att åstadkomma en bra design.
\item Studenterna skall möta en blandning av realistiska problem -- både stora och små -- där man tydligt kan resonera om styrkor och svagheter med olika lösningar.
\item Studenterna skall skaffa sig en bred och mångsidig verktygslåda för programvarudesign, med en ingående förståelse för syftet med varje verktyg.
\item Studenterna skall skaffa sig en översiktlig förståelse för forskningsfronten inom ämnet och av skilnaderna mellan forskning och produktion.
\item Studenterna skall använda modern teknologi och moderna arbetssätt när de arbetar i kursen.
\item Kursen skall använda sig av modern teknologi och moderna arbetssätt för att erbjuda kursinnehållet.
\item Studenterna skall -- i alla kurser -- utsättas för ett arbetssätt och en mentalitet som är baserad på modern industripraxis.
\end{itemize}
\end{document}